app/Model/Student.php

    public function stdPay($sID){
        $builder = $this->db->table('student');
        $student=$builder->select('firstName,lastName,contactNumber,address,email,city')->
        where('sID',$sID)->get()->getFirstRow();
---
SELECT `firstName`, `lastName`, `contactNumber`, `address`, `email`, `city`
FROM `student`
WHERE `sID` = '32'