app/Controllers/courseController.php

SELECT *
FROM `course`
---
    public function fetch(){

        $course=new Course();
        $courses['course']=$course->findAll();