app/Controllers/courseController.php

    public function fetch(){

        $course=new Course();
        $courses['course']=$course->findAll();
---
SELECT *
FROM `course`