app/Controllers/studentController.php

DELETE FROM `student`
WHERE `sID` IN ('25')
---
    public function delete(){
        $student=new Student();
        $sID=$this->request->getPost('sID');
        $sIDx=implode(' ',[' ',$sID]);
        log_message('alert',$sIDx);

        if($student->delete($sID)){
            $student->delete($sID);