app/Models/Course.php

    public function editCourse($cID)
    {
        try
        {
            $builder=$this->db->table('course');
            return $builder->select('*')->where('cID',$cID)->get()->getFirstRow();
---
SELECT *
FROM `course`
WHERE `cID` = 'IT100'