app/Models/Order.php

    public function getPreAppOrders(){

        $builder=$this->db->table('orders');

        $data = $builder->select('order_id,sID,order_title,status_message,amount')->where('customer_token IS NOT NULL AND LENGTH(customer_token)>0',NULL,false)->get()->getResult();
---
SELECT `order_id`, `sID`, `order_title`, `status_message`, `amount`
FROM `orders`
WHERE customer_token IS NOT NULL AND LENGTH(customer_token)>0

    public function toPayhereChargin($order_id){

        log_message('alert',$order_id);

        $builder=$this->db->table('orders');

        $data=(array)$builder->select('order_id,order_title,amount,customer_token')
        ->where('order_id',$order_id)->get()->getRow();
---
SELECT `order_id`, `order_title`, `amount`, `customer_token`
FROM `orders`
WHERE `order_id` = '179'