app/Models/Student.php

SELECT *
FROM `student`
---
    public function fetchStudents(){

        try{

            $builder = $this->db->table('student');
            $builder->select('*');
            $students = $builder->get()->getResult();

SELECT `firstName`, `lastName`, `contactNumber`, `address`, `email`, `city`
FROM `student`
WHERE `sID` = '32'
---
    public function stdPay($sID){
        $builder = $this->db->table('student');
        $student=$builder->select('firstName,lastName,contactNumber,address,email,city')->
        where('sID',$sID)->get()->getFirstRow();