app/Models/User.php

SELECT *
FROM `user`
WHERE `username` = 'kamal'
---
    public function userlogin ($username,$password){

        $builder=$this->db->table('user');
        $builder->select('*')->where('username',$username);
        $qeryR=$builder->get();